function getAllDayCurrentYear() {
	let nowDate = new Date()
	let currentYear = nowDate.getFullYear()
	let howYear = new Date(currentYear, 2, 0)
	if (howYear.getDate() === 29) {
		return 366
	} else {
		return 365
	}
}

let dateArr = []

for (let i = 1; i <= getAllDayCurrentYear(); i++) {
	dateArr.push(i)
}

let zodiacSigns = [
	'Козерог',
	'Водолей',
	'Рыбы',
	'Овен',
	'Телец',
	'Близнецы',
	'Рак',
	'Лев',
	'Дева',
	'Весы',
	'Скорпион',
	'Стрелец',
]

// let zod = {
// 	Козерог: '23.11-20.00',
// 	Водолей: '21.00—19.01',
// 	Рыбы: '20.01-20.02',
// 	Овен: '21.02-20.03',
// 	Телец: '21.03-21.04',
// 	Близнецы: '22.04-21.05',
// 	Рак: '22.05-22.06',
// 	Лев: '23.06-21.07',
// 	Дева: '22.07-23.08',
// 	Весы: '24.08-23.09',
// 	Скорпион: '24.09-23.10',
// 	Стрелец: '24.10-22.11',
// }

let zodArr = [
	{ Козерог: '23.12-20.01' },
	{ Водолей: '21.01—19.02' },
	{ Рыбы: '20.02-20.03' },
	{ Овен: '21.03-20.04' },
	{ Телец: '21.04-21.05' },
	{ Близнецы: '22.05-21.06' },
	{ Рак: '22.06-22.07' },
	{ Лев: '23.07-21.08' },
	{ Дева: '22.08-23.09' },
	{ Весы: '24.09-23.10' },
	{ Скорпион: '24.10-23.11' },
	{ Стрелец: '24.11-22.12' },
]

export { dateArr, zodArr }
