const events = [
	[
		{ date: '02.05.2016', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2016', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2016', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '19.01.2017', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '19.01.2017', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '19.01.2017', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2018', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2018', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2018', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2019', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2019', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2019', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2020', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2020', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2020', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2021', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2021', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2021', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2022', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2022', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2022', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2023', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2023', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2023', fact: 'факт 3', desc: 'описание факта 3' },
	],
	[
		{ date: '02.05.2024', fact: 'факт 1', desc: 'описание факта 1' },
		{ date: '24.03.2024', fact: 'факт 2', desc: 'описание факта 2' },
		{ date: '24.03.2024', fact: 'факт 3', desc: 'описание факта 3' },
	],
]

let [
	year2016,
	year2017,
	year2018,
	year2019,
	year2020,
	year2021,
	year2022,
	year2023,
	year2024,
] = events

export {
	year2016,
	year2017,
	year2018,
	year2019,
	year2020,
	year2021,
	year2022,
	year2023,
	year2024,
}
