//В браузере существует так называемое локальное хранилище, позволяющее хранить данные между заходами пользователя на сайт (5-10 мегабайт информации).

//Доступ к данным производится по ключу: вы сохраняете данные с каким-то ключом, а затем можете получить их по этому ключу или удалить. При этом разрешено сохранять только строки. Для работы с данными есть специальные методы. Давайте их рассмотрим.

//Для хранения данных используется два типа хранилищ: sessionStorage и localStorage. Первое хранит данные только до закрытия браузера, а второе - всегда.
