export const tagDescriptionsList = {
	html: 'Элемент HTML является корневым элементом HTML-документа. Все другие элементы должны быть потомками этого элемента.',
	head: 'Элемент HTML <head> содержит метаданные (такие как ссылки на стили, скрипты и т.д.) для документа HTML.',
	body: 'Элемент HTML <body> представляет собой контент (содержимое) документа HTML. В документе может быть только один элемент <body>.',
	div: 'Элемент HTML <div> (от англ. division - раздел) является универсальным контейнером для других элементов.',
	span: 'Элемент HTML <span> используется для группировки инлайновых элементов документа.',
	p: 'Элемент HTML <p> представляет собой абзац.',
	a: 'Элемент HTML <a> (от англ. anchor - якорь) определяет гипертекстовые ссылки.',
	img: 'Элемент HTML <img> используется для вставки изображения в документ.',
	h1: 'Элемент HTML <h1> - <h6> представляет собой 6 уровней заголовков разделов. <h1> это наибольший заголовок и <h6> - наименьший.',
	ul: 'Элемент HTML <ul> (от англ. unordered list - неупорядоченный список) представляет собой маркированный список элементов.',
	ol: 'Элемент HTML <ol> (от англ. ordered list - упорядоченный список) представляет собой нумерованный список элементов.',
	li: 'Элемент HTML <li> (от англ. list item - элемент списка) используется для представления элемента списка.',
	table: 'Элемент HTML <table> представляет данные в двухмерной таблице.',
	tr: 'Элемент HTML <tr> (от англ. table row - строка таблицы) определяет строку таблицы.',
	td: 'Элемент HTML <td> (от англ. table data - данные таблицы) используется для создания ячейки данных внутри строки.',
	th: 'Элемент HTML <th> (от англ. table header - заголовок таблицы) определяет ячейку заголовка внутри строки.',
	form: 'Элемент HTML <form> используется для создания интерактивных элементов управления, которые позволяют веб-пользователю отправлять данные на веб-сервер.',
	input:
		'Элемент HTML <input> используется для создания интерактивных элементов управления для формы веб-страницы.',
	button:
		'Элемент HTML <button> представляет собой кнопку, которую можно нажать.',
	select:
		'Элемент HTML <select> представляет собой элемент управления, который позволяет пользователю выбирать из нескольких вариантов.',
	option:
		'Элемент HTML <option> используется для создания вариантов в раскрывающемся меню <select>.',
	textarea:
		'Элемент HTML <textarea> представляет собой элемент формы, который позволяет пользователю вводить многострочный текст.',
}
